{
    "score": 65,
    "risques": [
        {
            "nom": "Utilisateurs avec privilèges excessifs",
            "severite": "Critique",
            "details": "Le rôle DBA dispose de privilèges dangereux comme DROP ANY TABLE, DROP ANY INDEX, DROP ANY VIEW, GRANT ANY PRIVILEGE, GRANT ANY ROLE, CREATE ANY TABLE, etc. Ces privilèges permettent une escalade complète et la destruction de l'environnement. Le rôle IMP_FULL_DATABASE possède également des privilèges excessifs (GRANT ANY ROLE, DROP ANY TABLE, etc.)."
        },
        {
            "nom": "Absence de protection par mot de passe sur les rôles",
            "severite": "Élevé",
            "details": "Tous les rôles listés (CONNECT, RESOURCE, DBA, etc.) ont PASSWORD_REQUIRED='NO' et AUTHENTICATION_TYPE='NONE'. Cela signifie qu'aucun rôle n'est protégé par mot de passe, facilitant l'usurpation de privilèges si un compte avec ces rôles est compromis."
        },
        {
            "nom": "Profils de sécurité non configurés",
            "severite": "Élevé",
            "details": "Tous les utilisateurs utilisent le profil DEFAULT (d'après DBA_USERS). Sans données sur DBA_PROFILES, on peut supposer que le profil DEFAULT n'a pas de limites de sécurité (FAILED_LOGIN_ATTEMPTS illimité, PASSWORD_LIFE_TIME illimité, etc.), laissant la base vulnérable aux attaques par brute-force et aux mots de passe périmés."
        },
        {
            "nom": "Comptes système ouverts inutilement",
            "severite": "Moyen",
            "details": "Les comptes OPS$ORACLE et SYSRAC sont ouverts (ACCOUNT_STATUS='OPEN'). OPS$ORACLE a une dernière connexion récente (2026-01-12). Ces comptes présentent une surface d'attaque supplémentaire et doivent être verrouillés s'ils ne sont pas nécessaires."
        },
        {
            "nom": "Privilèges GRANT ANY excessifs accordés largement",
            "severite": "Critique",
            "details": "Les privilèges GRANT ANY PRIVILEGE et GRANT ANY ROLE sont accordés à SYS, DBA, IMP_FULL_DATABASE, DATAPUMP_IMP_FULL_DATABASE et EM_EXPRESS_ALL. Cela permet à tout utilisateur disposant de ces rôles d'octroyer n'importe quel privilège système, contournant le contrôle d'accès."
        },
        {
            "nom": "Privilèges DROP ANY excessifs",
            "severite": "Critique",
            "details": "De nombreux privilèges DROP ANY (DROP ANY TABLE, DROP ANY INDEX, DROP ANY VIEW, DROP ANY PROCEDURE, etc.) sont accordés au rôle DBA et à d'autres rôles puissants. Ces privilèges permettent une destruction massive d'objets de la base."
        }
    ],
    "recommandations": [
        "1. Réviser immédiatement la matrice des privilèges système. Retirer les privilèges DROP ANY, GRANT ANY, et CREATE ANY non essentiels du rôle DBA et des autres rôles applicatifs. Appliquer le principe du moindre privilège.",
        "2. Créer et appliquer des profils de sécurité stricts. Définir FAILED_LOGIN_ATTEMPTS entre 3 et 5, PASSWORD_LIFE_TIME à 90 jours maximum, et utiliser une fonction de vérification de complexité des mots de passe (via UTLPWDMG). Assigner ces profils à tous les utilisateurs, en commençant par les comptes non-système.",
        "3. Protéger les rôles sensibles avec des mots de passe. Configurer PASSWORD_REQUIRED='YES' pour les rôles DBA, RESOURCE, CONNECT, et tout rôle disposant de privilèges élevés.",
        "4. Verrouiller les comptes système inutilisés. Vérifier la nécessité de OPS$ORACLE et SYSRAC. S'ils ne sont pas requis pour les opérations courantes, les verrouiller (ALTER USER ... ACCOUNT LOCK).",
        "5. Implémenter un audit unifié (Unified Audit) pour tracer l'utilisation des privilèges dangereux (DROP ANY, GRANT ANY), les tentatives de connexion échouées, et les changements de privilèges. Surveiller particulièrement les actions en dehors des heures normales.",
        "6. Segmenter les privilèges. Remplacer l'utilisation du rôle DBA omnipotent par des rôles personnalisés accordant uniquement les privilèges nécessaires à une fonction spécifique (ex: rôle de lecture seule, rôle de maintenance limité).",
        "7. Réviser et limiter les privilèges accordés aux rôles fonctionnels comme IMP_FULL_DATABASE, EM_EXPRESS_ALL, et SCHEDULER_ADMIN pour qu'ils correspondent strictement à leur usage prévu."
    ]
}