[
    {
        "sql_id": "guw87u8x36z8r",
        "explication_plan": "Le plan d'exécution est marqué 'UNKNOWN', ce qui indique que l'optimiseur n'a pas pu générer un plan stable ou que les statistiques sont absentes/périmées pour la table WRI$_SQLSET_PLANS. L'opération est une mise à jour (UPDATE) ciblant des lignes spécifiques via une clause WHERE sur STMT_ID et PLAN_HASH_VALUE. Sans plan visible, on suppose que l'optimiseur pourrait effectuer un TABLE ACCESS FULL (scan complet) par défaut si aucun index adapté n'existe ou si les statistiques sont obsolètes, ce qui serait très coûteux sur une grande table.",
        "points_couteux": [
            "1. Plan 'UNKNOWN' : L'absence de plan fiable empêche toute analyse précise et peut masquer un accès par TABLE ACCESS FULL.",
            "2. Clause WHERE non indexée potentiellement : Si aucun index composite sur (STMT_ID, PLAN_HASH_VALUE) n'existe, la recherche des lignes à mettre à jour nécessitera un scan complet de la table.",
            "3. Mise à jour de colonnes LOB (BIND_DATA) : La colonne BIND_DATA est probablement de type LOB (BLOB/CLOB). Sa mise à jour est coûteuse en I/O et peut générer de la fragmentation si la table est fréquemment modifiée."
        ],
        "recommandations": [
            {
                "type": "Index",
                "description": "Créez un index composite sur les colonnes de la clause WHERE : CREATE INDEX IDX_WRI_SQLSET_PLANS_MAJ ON WRI$_SQLSET_PLANS(STMT_ID, PLAN_HASH_VALUE) TABLESPACE <tablespace_index> ; Cela permettra un INDEX UNIQUE SCAN ou INDEX RANGE SCAN rapide pour localiser les lignes."
            },
            {
                "type": "SQL",
                "description": "Rafraîchissez les statistiques de la table et de ses index avec : EXEC DBMS_STATS.GATHER_TABLE_STATS(ownname=>'<schema_owner>', tabname=>'WRI$_SQLSET_PLANS', estimate_percent=>DBMS_STATS.AUTO_SAMPLE_SIZE, cascade=>TRUE, degree=>4); Cela permettra à l'optimiseur de générer un plan optimal basé sur la cardinalité réelle."
            },
            {
                "type": "Hint",
                "description": "Si un index existe déjà mais est ignoré, forcez son utilisation dans la requête : UPDATE /*+ INDEX(w WRI_SQLSET_PLANS_MAJ) */ WRI$_SQLSET_PLANS w SET BIND_DATA = :B4, BINDS_CAPTURED = :B3 WHERE STMT_ID = :B2 AND PLAN_HASH_VALUE = :B1 ; Remplacez 'WRI_SQLSET_PLANS_MAJ' par le nom réel de l'index."
            }
        ],
        "gain_estime": "75% (réduction majeure grâce à l'indexation et aux statistiques à jour, évitant un scan complet potentiel)"
    },
    {
        "sql_id": "16cffsk1wdzcc",
        "explication_plan": "Le plan d'exécution est marqué 'UNKNOWN', ce qui indique que l'optimiseur n'a pas pu générer un plan stable ou que les statistiques sont absentes/périmées. La requête filtre sur USER# avec un bind variable (:1) pour récupérer 5 colonnes de la table système SYS.USER$.",
        "points_couteux": [
            "Absence de plan d'exécution identifiable (UNKNOWN) - impossible d'évaluer le coût réel",
            "Accès potentiel en TABLE ACCESS FULL si aucun index sur USER# n'est utilisé ou si les statistiques sont obsolètes",
            "Risque de dégradation si la table SYS.USER$ est grande (après import massif) sans index approprié"
        ],
        "recommandations": [
            {
                "type": "SQL",
                "description": "Vérifier et mettre à jour les statistiques : EXEC DBMS_STATS.GATHER_TABLE_STATS('SYS', 'USER$', cascade=>TRUE);"
            },
            {
                "type": "Index",
                "description": "S'assurer que l'index sur USER# existe (I_USER1 par défaut) et qu'il est utilisé. Si manquant : CREATE INDEX SYS.IDX_USER# ON SYS.USER$(USER#);"
            },
            {
                "type": "Hint",
                "description": "Forcer l'utilisation de l'index si nécessaire : SELECT /*+ INDEX(u I_USER1) */ exptime, ltime, astatus, lcount, ptime FROM sys.user$ u WHERE user#=:1"
            }
        ],
        "gain_estime": "70-90% (passage potentiel de FULL SCAN à INDEX UNIQUE SCAN si l'index existe et que les statistiques sont à jour)"
    },
    {
        "sql_id": "114ujmcuu3z7b",
        "explication_plan": "Cette requête système Oracle interroge la table SYS.SYSAUTH$ pour extraire des informations sur les privilèges et leurs options. Le plan UNKNOWN indique que l'optimiseur n'a pas pu générer un plan d'exécution standard, probablement parce que c'est une requête interne du dictionnaire de données ou qu'elle utilise des fonctions système non documentées (BITAND, NVL). La requête agrège des informations de privilèges avec des opérations bit à bit pour décoder les options de grant.",
        "points_couteux": [
            "Plan UNKNOWN - impossible d'analyser le chemin d'exécution réel",
            "Utilisation intensive de fonctions BITAND et NVL sur chaque ligne",
            "Absence de prédicats WHERE - scan complet de SYSAUTH$ (table système critique)"
        ],
        "recommandations": [
            {
                "type": "SQL",
                "description": "Éviter d'exécuter directement cette requête système. Utiliser plutôt les vues dictionnaire standard comme DBA_TAB_PRIVS, DBA_SYS_PRIVS ou DBA_ROLE_PRIVS qui sont optimisées et maintenues par Oracle."
            },
            {
                "type": "Hint",
                "description": "Si nécessaire d'exécuter cette requête exacte, ajouter /*+ FULL(SYSAUTH$) */ pour forcer un scan complet cohérent, car les tables système doivent généralement être lues en entier pour ce type d'agrégation."
            },
            {
                "type": "Index",
                "description": "Pour les requêtes sur les privilèges, s'assurer que les statistiques des vues dictionnaire sont à jour avec : EXEC DBMS_STATS.GATHER_DICTIONARY_STATS;"
            }
        ],
        "gain_estime": "Non applicable - requête système interne. L'utilisation des vues dictionnaire officielles peut offrir jusqu'à 90% de gain par rapport aux requêtes directes sur les tables système."
    }
]