{
    "score": 65,
    "risques": [
        {
            "nom": "Compte fantôme avec privilège destructeur",
            "severite": "Critique",
            "details": "L'utilisateur GHOST_USER est un compte fantôme (nom suspect, dernière connexion tardive) disposant du privilège système DROP ANY TABLE. Ce privilège permet de supprimer n'importe quelle table de la base, y compris les tables système, ce qui constitue un risque d'intégrité et de disponibilité majeur."
        },
        {
            "nom": "Privilèges systèmes excessifs pour le rôle DBA",
            "severite": "Critique",
            "details": "Le rôle DBA dispose du privilège ANY (CREATE TABLE) avec ADMIN OPTION (YES). Bien que le rôle DBA soit par définition puissant, l'option ADMIN permet à ses détenteurs de le regranter, facilitant l'escalade de privilèges. De plus, l'utilisateur SYS dispose de ANY PRIVILEGE avec ADMIN OPTION, ce qui lui permet d'accorder n'importe quel privilège à n'importe qui, y compris lui-même."
        },
        {
            "nom": "Absence de politique de mot de passe sécurisée",
            "severite": "Élevée",
            "details": "Les rôles DBA, CONNECT et RESOURCE ne nécessitent pas de mot de passe (PASSWORD_REQUIRED: NO, AUTHENTICATION_TYPE: NONE). Cela signifie qu'ils peuvent être activés sans vérification supplémentaire par tout utilisateur à qui ils sont accordés, réduisant la sécurité par couches. Le profil par défaut (DEFAULT) est utilisé pour des comptes sensibles (SYS, GHOST_USER), ce qui indique probablement l'absence de paramètres stricts (échecs de connexion limités, durée de vie des mots de passe)."
        },
        {
            "nom": "Privilège insuffisant pour l'utilisateur applicatif",
            "severite": "Moyenne",
            "details": "L'utilisateur HR_APP ne dispose que du privilège CREATE SESSION. S'il s'agit d'un compte applicatif légitime, il manque très probablement des privilèges sur les objets (tables, vues, procédures) nécessaires à son fonctionnement, ce qui peut inciter à lui accorder des rôles trop permissifs (comme RESOURCE) pour pallier ce manque, violant ainsi le principe du moindre privilège."
        },
        {
            "nom": "Absence de traçabilité (Audit)",
            "severite": "Moyenne",
            "details": "Aucune information d'audit n'est fournie dans les données. Sans audit activé sur les échecs de connexion, les privilèges DDL (comme DROP ANY TABLE) et les modifications de privilèges, il est impossible de détecter les tentatives d'intrusion, les abus de privilèges ou l'escalade de privilèges."
        }
    ],
    "recommandations": [
        "1. IMMÉDIAT : Révoquer le privilège DROP ANY TABLE de l'utilisateur GHOST_USER. Enquêter sur l'origine et l'utilité de ce compte. Le supprimer ou le désactiver (ALTER USER GHOST_USER ACCOUNT LOCK) s'il n'est pas légitime.",
        "2. Réviser et limiter les privilèges avec ADMIN OPTION, notamment pour l'utilisateur SYS (privilège existant) et le rôle DBA. Éviter d'accorder ADMIN OPTION sur des privilèges puissants à des rôles largement distribués.",
        "3. Créer et appliquer un profil de sécurité robuste (ex: SECURE_PROFILE) avec FAILED_LOGIN_ATTEMPTS = 3, PASSWORD_LIFE_TIME = 90, et une fonction de complexité. L'appliquer à tous les utilisateurs, notamment SYS et les comptes applicatifs. Remplacer le profil DEFAULT par ce nouveau profil.",
        "4. Pour les rôles sensibles comme APP_ADMIN, s'assurer que PASSWORD_REQUIRED est activé. Éviter d'utiliser les rôles CONNECT et RESOURCE prédéfinis pour la sécurité ; créer des rôles personnalisés avec des privilèges granulaires spécifiques à l'application.",
        "5. Implémenter l'Audit Unifié (ou standard) pour tracer : les échecs de connexion (CREATE SESSION), l'usage des privilèges ANY (DROP ANY TABLE, GRANT ANY PRIVILEGE), et les modifications des privilèges/rôles. Consulter régulièrement la vue UNIFIED_AUDIT_TRAIL (ou AUD$).",
        "6. Pour HR_APP, auditer ses besoins réels et lui accorder des privilèges granulaires sur les objets spécifiques (GRANT SELECT, INSERT ON schema.table) plutôt que des rôles génériques puissants."
    ]
}